RT-Thread/rt-thread/bsp/nuvoton/libraries/m031/StdDriver/inc/nu_gpio.h
#define PG2             GPIO_PIN_DATA(6, 2 ) /*!< Specify PG.2  Pin Data Input/Output \hideinitializer */
#define PG3             GPIO_PIN_DATA(6, 3 ) /*!< Specify PG.3  Pin Data Input/Output \hideinitializer */
#define PG4             GPIO_PIN_DATA(6, 4 ) /*!< Specify PG.4  Pin Data Input/Output \hideinitializer */
#define PG9             GPIO_PIN_DATA(6, 9 ) /*!< Specify PG.9  Pin Data Input/Output \hideinitializer */
#define PG10            GPIO_PIN_DATA(6, 10) /*!< Specify PG.10 Pin Data Input/Output \hideinitializer */
#define PG11            GPIO_PIN_DATA(6, 11) /*!< Specify PG.11 Pin Data Input/Output \hideinitializer */
#define PG12            GPIO_PIN_DATA(6, 12) /*!< Specify PG.12 Pin Data Input/Output \hideinitializer */
#define PG13            GPIO_PIN_DATA(6, 13) /*!< Specify PG.13 Pin Data Input/Output \hideinitializer */
#define PG14            GPIO_PIN_DATA(6, 14) /*!< Specify PG.14 Pin Data Input/Output \hideinitializer */
#define PG15            GPIO_PIN_DATA(6, 15) /*!< Specify PG.15 Pin Data Input/Output \hideinitializer */

#define PH4             GPIO_PIN_DATA(7, 4 ) /*!< Specify PH.4  Pin Data Input/Output \hideinitializer */
#define PH5             GPIO_PIN_DATA(7, 5 ) /*!< Specify PH.5  Pin Data Input/Output \hideinitializer */
#define PH6             GPIO_PIN_DATA(7, 6 ) /*!< Specify PH.6  Pin Data Input/Output \hideinitializer */
#define PH7             GPIO_PIN_DATA(7, 7 ) /*!< Specify PH.7  Pin Data Input/Output \hideinitializer */
#define PH8             GPIO_PIN_DATA(7, 8 ) /*!< Specify PH.8  Pin Data Input/Output \hideinitializer */
#define PH9             GPIO_PIN_DATA(7, 9 ) /*!< Specify PH.9  Pin Data Input/Output \hideinitializer */
#define PH10            GPIO_PIN_DATA(7, 10) /*!< Specify PH.10 Pin Data Input/Output \hideinitializer */
#define PH11            GPIO_PIN_DATA(7, 11) /*!< Specify PH.11 Pin Data Input/Output \hideinitializer */

/*---------------------------------------------------------------------------------------------------------*/
/*  GPIO_MODE Constant Definitions                                                                         */
/*---------------------------------------------------------------------------------------------------------*/
#define GPIO_MODE_INPUT         0x0UL                  /*!< Input Mode      \hideinitializer */
#define GPIO_MODE_OUTPUT        0x1UL                  /*!< Output Mode     \hideinitializer */
#define GPIO_MODE_OPEN_DRAIN    0x2UL                  /*!< Open-Drain Mode \hideinitializer */
#define GPIO_MODE_QUASI         0x3UL                  /*!< Quasi-bidirectional Mode    \hideinitializer */
#define GPIO_MODE(pin, mode)    ((mode) << ((pin)<<1)) /*!< Generate the PMD mode setting for each pin      \hideinitializer */

/*---------------------------------------------------------------------------------------------------------*/
/*  GPIO Interrupt Type Constant Definitions (Parameter of GPIO_EnableInt())                               */
/*---------------------------------------------------------------------------------------------------------*/
#define GPIO_INT_RISING         0x00010000UL /*!< Interrupt enable by Input Rising Edge     \hideinitializer */
#define GPIO_INT_FALLING        0x00000001UL /*!< Interrupt enable by Input Falling Edge    \hideinitializer */
#define GPIO_INT_BOTH_EDGE      0x00010001UL /*!< Interrupt enable by both Rising Edge and Falling Edge     \hideinitializer */
#define GPIO_INT_HIGH           0x01010000UL /*!< Interrupt enable by Level-High            \hideinitializer */
#define GPIO_INT_LOW            0x01000001UL /*!< Interrupt enable by Level-Low             \hideinitializer */

/*---------------------------------------------------------------------------------------------------------*/
/*  GPIO_INTTYPE Constant Definitions                                                                      */
/*---------------------------------------------------------------------------------------------------------*/
#define GPIO_INTTYPE_EDGE       0UL /*!< GPIO_INTTYPE Setting for Edge Trigger Mode \hideinitializer */
#define GPIO_INTTYPE_LEVEL      1UL /*!< GPIO_INTTYPE Setting for Level Mode        \hideinitializer */

/*---------------------------------------------------------------------------------------------------------*/
/*  GPIO_DBCTL Constant Definitions                                                                        */
/*---------------------------------------------------------------------------------------------------------*/
#define GPIO_DBCTL_ICLK_OFF           (0x0UL<<GPIO_DBCTL_ICLKON_Pos)    /*!< GPIO_DBCTL setting for edge detection circuit is active only if IO pin corresponding GPIOx_IEN bit is set to 1 \hideinitializer */
#define GPIO_DBCTL_ICLK_ON            (0x1UL<<GPIO_DBCTL_ICLKON_Pos)    /*!< GPIO_DBCTL setting for all IO pins edge detection circuit is always active after reset     \hideinitializer */

#define GPIO_DBCTL_DBCLKSRC_HCLK      (0x0UL<<GPIO_DBCTL_DBCLKSRC_Pos)  /*!< GPIO_DBCTL setting for de-bounce counter clock source is the HCLK  \hideinitializer */
#define GPIO_DBCTL_DBCLKSRC_LIRC      (0x1UL<<GPIO_DBCTL_DBCLKSRC_Pos)  /*!< GPIO_DBCTL setting for de-bounce counter clock source is the LIRC  \hideinitializer */

#define GPIO_DBCTL_DBCLKSEL_1         (0x0UL<<GPIO_DBCTL_DBCLKSEL_Pos)  /*!< GPIO_DBCTL setting for sampling cycle = 1 clocks   \hideinitializer */
#define GPIO_DBCTL_DBCLKSEL_2         (0x1UL<<GPIO_DBCTL_DBCLKSEL_Pos)  /*!< GPIO_DBCTL setting for sampling cycle = 2 clocks   \hideinitializer */
#define GPIO_DBCTL_DBCLKSEL_4         (0x2UL<<GPIO_DBCTL_DBCLKSEL_Pos)  /*!< GPIO_DBCTL setting for sampling cycle = 4 clocks   \hideinitializer */
#define GPIO_DBCTL_DBCLKSEL_8         (0x3UL<<GPIO_DBCTL_DBCLKSEL_Pos)  /*!< GPIO_DBCTL setting for sampling cycle = 8 clocks   \hideinitializer */
#define GPIO_DBCTL_DBCLKSEL_16        (0x4UL<<GPIO_DBCTL_DBCLKSEL_Pos)  /*!< GPIO_DBCTL setting for sampling cycle = 16 clocks  \hideinitializer */
#define GPIO_DBCTL_DBCLKSEL_32        (0x5UL<<GPIO_DBCTL_DBCLKSEL_Pos)  /*!< GPIO_DBCTL setting for sampling cycle = 32 clocks  \hideinitializer */
#define GPIO_DBCTL_DBCLKSEL_64        (0x6UL<<GPIO_DBCTL_DBCLKSEL_Pos)  /*!< GPIO_DBCTL setting for sampling cycle = 64 clocks  \hideinitializer */
#define GPIO_DBCTL_DBCLKSEL_128       (0x7UL<<GPIO_DBCTL_DBCLKSEL_Pos)  /*!< GPIO_DBCTL setting for sampling cycle = 128 clocks \hideinitializer */
#define GPIO_DBCTL_DBCLKSEL_256       (0x8UL<<GPIO_DBCTL_DBCLKSEL_Pos)  /*!< GPIO_DBCTL setting for sampling cycle = 256 clocks \hideinitializer */
#define GPIO_DBCTL_DBCLKSEL_512       (0x9UL<<GPIO_DBCTL_DBCLKSEL_Pos)  /*!< GPIO_DBCTL setting for sampling cycle = 512 clocks \hideinitializer */
#define GPIO_DBCTL_DBCLKSEL_1024      (0xAUL<<GPIO_DBCTL_DBCLKSEL_Pos)  /*!< GPIO_DBCTL setting for sampling cycle = 1024 clocks    \hideinitializer */
#define GPIO_DBCTL_DBCLKSEL_2048      (0xBUL<<GPIO_DBCTL_DBCLKSEL_Pos)  /*!< GPIO_DBCTL setting for sampling cycle = 2048 clocks    \hideinitializer */
#define GPIO_DBCTL_DBCLKSEL_4096      (0xCUL<<GPIO_DBCTL_DBCLKSEL_Pos)  /*!< GPIO_DBCTL setting for sampling cycle = 4096 clocks    \hideinitializer */
#define GPIO_DBCTL_DBCLKSEL_8192      (0xDUL<<GPIO_DBCTL_DBCLKSEL_Pos)  /*!< GPIO_DBCTL setting for sampling cycle = 8192 clocks    \hideinitializer */
#define GPIO_DBCTL_DBCLKSEL_16384     (0xEUL<<GPIO_DBCTL_DBCLKSEL_Pos)  /*!< GPIO_DBCTL setting for sampling cycle = 16384 clocks   \hideinitializer */
#define GPIO_DBCTL_DBCLKSEL_32768     (0xFUL<<GPIO_DBCTL_DBCLKSEL_Pos)  /*!< GPIO_DBCTL setting for sampling cycle = 32768 clocks   \hideinitializer */


/*@}*/ /* end of group GPIO_EXPORTED_CONSTANTS */

/** @addtogroup GPIO_EXPORTED_FUNCTIONS GPIO Exported Functions
  @{
*/

/**
  * @brief       Clear GPIO Pin Interrupt Flag
  * @param[in]   port        GPIO port. It could be PA, PB, PC, PD, PE, PF, PG, or PH.
  * @param[in]   u32PinMask  The single or multiple pins of specified GPIO port.
  *                          It could be BIT0 ~ BIT15 for PA, PB, PD, and PE.
  *                          It could be BIT0 ~ BIT14 for PC.
  *                          It could be BIT0 ~ BIT11, BIT14, and BIT15 for PF.
  *                          It could be BIT2 ~ BIT4, and BIT9 ~ BIT15 for PG.
  *                          It could be BIT4 ~ BIT11 for PH.
  * @return      None
  * @details     Clear the interrupt status of specified GPIO pin.
  * \hideinitializer
  */
#define GPIO_CLR_INT_FLAG(port, u32PinMask)         ((port)->INTSRC = (u32PinMask))

/**
  * @brief       Disable Pin De-bounce Function
  * @param[in]   port        GPIO port. It could be PA, PB, PC, PD, PE, PF, PG, or PH.
  * @param[in]   u32PinMask  The single or multiple pins of specified GPIO port.
  *                          It could be BIT0 ~ BIT15 for PA, PB, PD, and PE.
  *                          It could be BIT0 ~ BIT14 for PC.
  *                          It could be BIT0 ~ BIT11, BIT14, and BIT15 for PF.
  *                          It could be BIT2 ~ BIT4, and BIT9 ~ BIT15 for PG.
  *                          It could be BIT4 ~ BIT11 for PH.
  * @return      None
  * @details     Disable the interrupt de-bounce function of specified GPIO pin.
  * \hideinitializer
  */
#define GPIO_DISABLE_DEBOUNCE(port, u32PinMask)     ((port)->DBEN &= ~(u32PinMask))

/**
  * @brief       Enable Pin De-bounce Function
  * @param[in]   port        GPIO port. It could be PA, PB, PC, PD, PE, PF, PG, or PH.
  * @param[in]   u32PinMask  The single or multiple pins of specified GPIO port.
  *                          It could be BIT0 ~ BIT15 for PA, PB, PD, and PE.
  *                          It could be BIT0 ~ BIT14 for PC.
  *                          It could be BIT0 ~ BIT11, BIT14, and BIT15 for PF.
  *                          It could be BIT2 ~ BIT4, and BIT9 ~ BIT15 for PG.
  *                          It could be BIT4 ~ BIT11 for PH.
  * @return      None
  * @details     Enable the interrupt de-bounce function of specified GPIO pin.
  * \hideinitializer
  */
#define GPIO_ENABLE_DEBOUNCE(port, u32PinMask)      ((port)->DBEN |= (u32PinMask))

/**
  * @brief       Disable I/O Digital Input Path
  * @param[in]   port        GPIO port. It could be PA, PB, PC, PD, PE, PF, PG, or PH.
  * @param[in]   u32PinMask  The single or multiple pins of specified GPIO port.
  *                          It could be BIT0 ~ BIT15 for PA, PB, PD, and PE.
  *                          It could be BIT0 ~ BIT14 for PC.
  *                          It could be BIT0 ~ BIT11, BIT14, and BIT15 for PF.
  *                          It could be BIT2 ~ BIT4, and BIT9 ~ BIT15 for PG.
  *                          It could be BIT4 ~ BIT11 for PH.
  * @return      None
  * @details     Disable I/O digital input path of specified GPIO pin.
  * \hideinitializer
  */
#define GPIO_DISABLE_DIGITAL_PATH(port, u32PinMask) ((port)->DINOFF |= ((u32PinMask)<<16))

/**
  * @brief       Enable I/O Digital Input Path
  * @param[in]   port        GPIO port. It could be PA, PB, PC, PD, PE, PF, PG, or PH.
  * @param[in]   u32PinMask  The single or multiple pins of specified GPIO port.
  *                          It could be BIT0 ~ BIT15 for PA, PB, PD, and PE.
  *                          It could be BIT0 ~ BIT14 for PC.
  *                          It could be BIT0 ~ BIT11, BIT14, and BIT15 for PF.
  *                          It could be BIT2 ~ BIT4, and BIT9 ~ BIT15 for PG.
  *                          It could be BIT4 ~ BIT11 for PH.
  * @return      None
  * @details     Enable I/O digital input path of specified GPIO pin.
  * \hideinitializer
  */
#define GPIO_ENABLE_DIGITAL_PATH(port, u32PinMask)  ((port)->DINOFF &= ~((u32PinMask)<<16))

/**
  * @brief       Disable I/O DOUT mask
  * @param[in]   port        GPIO port. It could be PA, PB, PC, PD, PE, PF, PG, or PH.
  * @param[in]   u32PinMask  The single or multiple pins of specified GPIO port.
  *                          It could be BIT0 ~ BIT15 for PA, PB, PD, and PE.
  *                          It could be BIT0 ~ BIT14 for PC.
  *                          It could be BIT0 ~ BIT11, BIT14, and BIT15 for PF.
  *                          It could be BIT2 ~ BIT4, and BIT9 ~ BIT15 for PG.
  *                          It could be BIT4 ~ BIT11 for PH.
  * @return      None
  * @details     Disable I/O DOUT mask of specified GPIO pin.
  * \hideinitializer
  */
#define GPIO_DISABLE_DOUT_MASK(port, u32PinMask)    ((port)->DATMSK &= ~(u32PinMask))

/**
  * @brief       Enable I/O DOUT mask
  * @param[in]   port        GPIO port. It could be PA, PB, PC, PD, PE, PF, PG, or PH.
  * @param[in]   u32PinMask  The single or multiple pins of specified GPIO port.
  *                          It could be BIT0 ~ BIT15 for PA, PB, PD, and PE.
  *                          It could be BIT0 ~ BIT14 for PC.
  *                          It could be BIT0 ~ BIT11, BIT14, and BIT15 for PF.
  *                          It could be BIT2 ~ BIT4, and BIT9 ~ BIT15 for PG.
  *                          It could be BIT4 ~ BIT11 for PH.
  * @return      None
  * @details     Enable I/O DOUT mask of specified GPIO pin.
  * \hideinitializer
  */
#define GPIO_ENABLE_DOUT_MASK(port, u32PinMask)     ((port)->DATMSK |= (u32PinMask))

/**
  * @brief       Get GPIO Pin Interrupt Flag
  * @param[in]   port        GPIO port. It could be PA, PB, PC, PD, PE, PF, PG, or PH.
  * @param[in]   u32PinMask  The single or multiple pins of specified GPIO port.
  *                          It could be BIT0 ~ BIT15 for PA, PB, PD, and PE.
  *                          It could be BIT0 ~ BIT14 for PC.
  *                          It could be BIT0 ~ BIT11, BIT14, and BIT15 for PF.
  *                          It could be BIT2 ~ BIT4, and BIT9 ~ BIT15 for PG.
  *                          It could be BIT4 ~ BIT11 for PH.
  * @retval      0           No interrupt at specified GPIO pin
  * @retval      1           The specified GPIO pin generate an interrupt
  * @details     Get the interrupt status of specified GPIO pin.
  * \hideinitializer
  */
#define GPIO_GET_INT_FLAG(port, u32PinMask)     ((port)->INTSRC & (u32PinMask))

/**
  * @brief       Set De-bounce Sampling Cycle Time
  * @param[in]   u32ClkSrc   The de-bounce counter clock source. It could be
  *                          - \ref GPIO_DBCTL_DBCLKSRC_HCLK
  *                          - \ref GPIO_DBCTL_DBCLKSRC_LIRC
  * @param[in]   u32ClkSel   The de-bounce sampling cycle selection. It could be
  *                          - \ref GPIO_DBCTL_DBCLKSEL_1
  *                          - \ref GPIO_DBCTL_DBCLKSEL_2
  *                          - \ref GPIO_DBCTL_DBCLKSEL_4
  *                          - \ref GPIO_DBCTL_DBCLKSEL_8
  *                          - \ref GPIO_DBCTL_DBCLKSEL_16
  *                          - \ref GPIO_DBCTL_DBCLKSEL_32
  *                          - \ref GPIO_DBCTL_DBCLKSEL_64
  *                          - \ref GPIO_DBCTL_DBCLKSEL_128
  *                          - \ref GPIO_DBCTL_DBCLKSEL_256
  *                          - \ref GPIO_DBCTL_DBCLKSEL_512
  *                          - \ref GPIO_DBCTL_DBCLKSEL_1024
  *                          - \ref GPIO_DBCTL_DBCLKSEL_2048
  *                          - \ref GPIO_DBCTL_DBCLKSEL_4096
  *                          - \ref GPIO_DBCTL_DBCLKSEL_8192
  *                          - \ref GPIO_DBCTL_DBCLKSEL_16384
  *                          - \ref GPIO_DBCTL_DBCLKSEL_32768
  * @return      None
  * @details     Set the interrupt de-bounce sampling cycle time based on the debounce counter clock source. \n
  *              Example: GPIO_SET_DEBOUNCE_TIME(GPIO_DBCTL_DBCLKSRC_LIRC, GPIO_DBCTL_DBCLKSEL_4). \n
  *              It's meaning the de-bounce counter clock source is LIRC (38.4 KHz) and sampling cycle selection is 4. \n
  *              Then the target de-bounce sampling cycle time is (4)*(1/38400) s = 4*26.042 us = 104.168 us,
  *              and system will sampling interrupt input once per 104.168 us.
  * \hideinitializer
  */
#define GPIO_SET_DEBOUNCE_TIME(u32ClkSrc, u32ClkSel)    (GPIO->DBCTL = (GPIO_DBCTL_ICLKON_Msk | (u32ClkSrc) | (u32ClkSel)))

/**
  * @brief       Set GPIO Interrupt Clock on bit
  * @param[in]   port        Not used in M031.
  * @return      None
  * @details     Set the I/O pins edge detection circuit always active after reset for specified port.
  * \hideinitializer
  */
#define GPIO_SET_DEBOUNCE_ICLKON(port)  (GPIO->DBCTL |= GPIO_DBCTL_ICLKON_Msk)

/**
  * @brief       Clear GPIO Interrupt Clock on bit
  * @param[in]   port        Not used in M031.
  * @return      None
  * @details     Set edge detection circuit active only if I/O pin edge interrupt enabled for specified port
  * \hideinitializer
  */
#define GPIO_CLR_DEBOUNCE_ICLKON(port)  (GPIO->DBCTL &= ~(GPIO_DBCTL_ICLKON_Msk))

/**
  * @brief       Get GPIO Port IN Data
  * @param[in]   port        GPIO port. It could be PA, PB, PC, PD, PE, PF, PG, or PH.
  * @return      The specified port data
  * @details     Get the PIN register of specified GPIO port.
  * \hideinitializer
  */
#define GPIO_GET_IN_DATA(port)  ((port)->PIN)

/**
  * @brief       Set GPIO Port OUT Data
  * @param[in]   port        GPIO port. It could be PA, PB, PC, PD, PE, PF, PG, or PH.
  * @param[in]   u32Data     GPIO port data.
  * @return      None
  * @details     Set the Data into specified GPIO port.
  * \hideinitializer
  */
#define GPIO_SET_OUT_DATA(port, u32Data)    ((port)->DOUT = (u32Data))

/**
  * @brief       Toggle Specified GPIO pin
  * @param[in]   u32Pin      Pxy
  * @return      None
  * @details     Toggle the specified GPIO pint.
  * \hideinitializer
  */
#define GPIO_TOGGLE(u32Pin) ((u32Pin) ^= 1)

/**
  * @brief       Enable External GPIO interrupt
  * @param[in]   port    GPIO port. It could be PA, PB, PC, PD, or PF.
  * @param[in]   u32Pin  The pin of specified GPIO port.
  *                      It could be 0 ~ 15 for PA, PB, PD, and PE.
  *                      It could be 0 ~ 14 for PC.
  *                      It could be 0 ~ 11, 14, and 15 for PF.
  *                      It could be 2 ~ 4, and 9 ~ 15 for PG.
  *                      It could be 4 ~ 11 for PH.
  * @param[in]   u32IntAttribs   The interrupt attribute of specified GPIO pin. It could be
  *                      - \ref GPIO_INT_RISING
  *                      - \ref GPIO_INT_FALLING
  *                      - \ref GPIO_INT_BOTH_EDGE
  *                      - \ref GPIO_INT_HIGH
  *                      - \ref GPIO_INT_LOW
  * @return      None
  * @details     This function is used to enable specified GPIO pin interrupt.
  * \hideinitializer
  */
#define GPIO_EnableEINT     GPIO_EnableInt

/**
  * @brief       Disable External GPIO interrupt
  * @param[in]   port    GPIO port. It could be PA, PB, PC, PD, or PF.
  * @param[in]   u32Pin  The pin of specified GPIO port.
  *                      It could be 0 ~ 15 for PA, PB, PD, and PE.
  *                      It could be 0 ~ 14 for PC.
  *                      It could be 0 ~ 11, 14, and 15 for PF.
  *                      It could be 2 ~ 4, and 9 ~ 15 for PG.
  *                      It could be 4 ~ 11 for PH.
  * @return      None
  * @details     This function is used to enable specified GPIO pin interrupt.
  * \hideinitializer
  */
#define GPIO_DisableEINT    GPIO_DisableInt


void GPIO_SetMode(GPIO_T *port, uint32_t u32PinMask, uint32_t u32Mode);
void GPIO_EnableInt(GPIO_T *port, uint32_t u32Pin, uint32_t u32IntAttribs);
void GPIO_DisableInt(GPIO_T *port, uint32_t u32Pin);


/*@}*/ /* end of group GPIO_EXPORTED_FUNCTIONS */

/*@}*/ /* end of group GPIO_Driver */

/*@}*/ /* end of group Standard_Driver */

#ifdef __cplusplus
}
#endif

#endif  /* __NU_GPIO_H__ */

/*** (C) COPYRIGHT 2018 Nuvoton Technology Corp. ***/
